# IFC_IsPsetDefined

## Description
Check if the custom Pset exists

```pascal
FUNCTION IFC_IsPsetDefined(strPsetName : STRING) : BOOLEAN;
```

```python

def vs.IFC_IsPsetDefined(strPsetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strPsetName|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC